Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: It makes you write labor-saving programs that other people will find useful, and document what you wrote so you don't have to answer so many questions about it.
es: Nos impulsa a escribir programas que nos ahorran trabajo y que pueden resultar útiles a otras personas, y a documentarlos para no tener que contestar consultas al respecto.

source: It may mean a command-line L</switch> that takes no argument itself (such as Perl's B<-n> and B<-p> flags) or, less frequently, a single-bit indicator (such as the C<O_CREAT> and C<O_EXCL> flags used in L<sysopen|perlfunc/sysopen>).
es: Puede ser un L</modificador> de línea de comandos que no consume ningún argumento (como las marcas B<-n> y B<-p> de perl) o, de forma menos frecuente, un indicador de un solo bit (como las marcas C<O_CREAT> y C<O_EXCL> que se usan en L<sysopen|perlfunc/sysopen>).

source: It may also be useful in places where the "grab all you can, and do not give anything back" semantic is desirable.
es: También puede ser útil cuando la semántica "capturar todo lo que se pueda y no devolver nada" sea deseable.

source: It may be better to sequentially rename your branches so that it is easier for others working with you to cherry-pick their local changes onto the new version.
es: Puede ser mejor cambiar el nombre de las ramas secuencialmente para que sus colaboradores puedan seleccionar fácilmente sus cambios locales para aplicárselos a la nueva versión.

source: It may do this by providing a mechanism for exporting some of its symbols into the symbol table of any package using it, or it may function as a class definition and make its semantics available implicitly through method calls on the class and its objects, without explicitly exporting anything.
es: Para ello puede proporcionar un mecanismo que exporte algunos de sus símbolos a la tabla de símbolos de cualquier paquete que lo use, o puede funcionar como una definición de clase y hacer que su semántica esté disponible implícitamente mediante llamadas a métodos de la clase y sus objetos, sin exportar nada de forma explícita.

source: It may or may not have input values (called L<arguments|/argument>).
es: Puede tener o no valores de entrada (denominados L<argumentos|/argumento>).

# It merely _looks_ like it should be confusing. ";
source: It merely _looks_ like it should be confusing.\n";
es: Parece lioso, pero no lo es en realidad.\n";

source: It only influences the way your sources are read.
es: Solo influye en la manera de leer el código fuente.

source: It only works when assigning to dynamic variables, not lexicals.
es: Sólo funciona al asignar valores a variables dinámicas (no léxicas).

source: It operates on C<$_> by default, or can be bound to another variable using the C<=~> binding operator (also documented in L<perlop>).
es: Opera en C<$_> de manera predeterminada, o se puede enlazar a otra variable con el operador de enlace C<=~> (que también se describe en L<perlop>).

source: It provides very few features, nor is it self-hosting.
es: Proporciona muy pocas características y no es autocontenido.

source: It quickly became a good language for many system management tasks.
es: Pronto se convirtió en un lenguaje útil para muchas tareas de administración de sistemas.

# It runs in order, of course. ";
source: It runs in order, of course.\n";
es: Por supuesto, se ejecuta por orden.\n";

source: It still counts as scalar context for functions that care whether or not they're being called in list context.
es: Cuenta como contexto de escalar para las funciones a las que les interesa saber si han sido llamadas en contexto de lista o no.

source: It uses the domain to provide general support services to the Perl community, including the hosting of mailing lists, web sites, and other services.
es: Usa el dominio para proporcionar servicios generales de soporte a la comunidad Perl, como el alojamiento de listas de correo y sitios web, entre otros.

source: It was abandoned in 2006 ( http://www.nntp.perl.org/group/perl.ponie.dev/487 ).
es: Se abandonó en 2006 ( http://www.nntp.perl.org/group/perl.ponie.dev/487 ).

source: It will often point out exactly where the trouble is.
es: Normalmente le indicará dónde está el problema.

source: It will also load the parent classes and make sure that the package doesn't inherit from itself.
es: También cargará las clases primarias y se asegurará de que el paquete no herede de sí mismo.

source: It will be called in the context of the new thread, so all modifications are made in the new area.
es: Se llamará en el contexto del nuevo hilo de ejecución, de forma que todas las modificaciones se realizarán en el nuevo espacio.

source: It will not be sent to C<STDERR> and it will not cause the program to die.
es: No se enviará a C<STDERR> y no hará que el programa finalice.

source: It will print 'A' and then terminate, as it considers the match to be zero-width, and thus will not match at the same position twice in a row.
es: Imprime 'A' y termina, pues considera que la coincidencia es de ancho cero y, por lo tanto, no coincidirá dos veces seguidas en la misma posición.

source: It will search the B<q>uestion headings in perlfaq[1-9] and print the entries matching the regular expression.
es: Busca en los encabezados de las preguntas ("q" viene de la palabra inglesa B<q>uestion) de perlfaq[1-9] e imprime en pantalla las entradas compatibles con la expresión regular.

source: It will use the same encoding for the source code and for STDIN and STDOUT.
es: Utilizará la misma codificación para el código fuente que para STDIN y STDOUT.

source: It would be much better if you could ignore the NULL terminations issue in the main application code and have a mechanism that automatically added the terminating NULL to all keys and values whenever you write to the database and have them removed when you read from the database.
es: Sería mucho mejor poder ignorar el problema de los caracteres NULL de terminación de cadena en el código principal de la aplicación y disponer de un mecanismo que agregue automáticamente un carácter NULL de terminación a todas las claves y todos los valores que se escriban en la base de datos, y lo elimine al leer de la base de datos.

source: It'll also appear in the main F<by-module> and F<by-category> directories if you make it onto the modules list.
es: También aparecerá en los directorios principales F<by-module> (por módulo) y F<by-category> (por categoría) si registra el módulo en la lista de módulos.

source: It's easy to program Unicode capable software, but it does require discipline to do it right.
es: Es fácil programar software compatible con Unicode, pero hacerlo bien requiere disciplina.

source: It's used by Java, C++, C#, Python, Ruby, and many other languages.
es: Se usa en Java, C++, C#, Python, Ruby y otros muchos lenguajes.

source: It's "C123", which suffices.
es: Se trata de "C123", que es suficiente.

source: It's a zero-width pattern similar to C<(*SKIP)>, except that when backtracked into on failure it causes the match to fail outright.
es: Es un patrón de ancho cero similar a C<(*SKIP)>, con la diferencia de que, cuando se produce la vuelta atrás a causa de un error, provoca un error de coincidencia de todo el patrón.

source: It's a good idea to put here what the module actually does in detail, and the user-visible changes since the last release.
es: Es recomendable incluir en el README una descripción detallada de lo que hace el módulo, así como los cambios visibles para el usuario con respecto a la versión anterior.

source: It's a good idea to run this on a pod file you've patched.
es: Tras aplicar un parche a un archivo pod, es recomendable ejecutar este programa.

source: It's a good option for a super minimal environment and for throwing something together quickly without having to worry about details.
es: Es una buena opción para entornos reducidos y para crear un programa rápidamente sin preocuparse de los detalles.

source: It's also very useful for creating skeletons of pure Perl modules.
es: También resulta muy útil para crear la estructura inicial de módulos Perl puros.

source: It's also a simple rule that works consistently with C<VAR_NAMES_LIKE_THIS>.
es: Es una regla sencilla que también se aplica C<NOMBRES_DE_VARIABLE_COMO_ESTE>.

source: It's also cheaper not to capture characters if you don't need to.
es: También sale más barato no capturar caracteres si no son necesarios.

source: It's also the source of a useful idiom for executing a function or performing an operation in list context and then counting the number of return values, by assigning to an empty list and then using that assignment in scalar context.
es: Es también el origen de un modismo muy útil para ejecutar una función o realizar una operación en contexto de lista, y luego contar el número de valores devueltos, mediante la asignación a una lista vacía y el uso posterior de esa asignación en contexto de escalar.

source: It's an alternative to C<make test>.
es: Es una alternativa a C<make test>.

source: It's been around a long time and is well battle-tested.
es: Se ha utilizado durante mucho tiempo y está bien probado.

source: It's better to pretend that the internal format is some unknown encoding, and that you always have to encode and decode explicitly.
es: Es mejor imaginar que el formato interno es alguna codificación desconocida y acostumbrarse a codificar y descodificar explícitamente siempre.

source: It's documented in extravagant detail in L<perlfunc> and L<perlopentut>, but in short:
es: Esta función se describe de forma muy detallada en L<perlfunc> y L<perlopentut>. A continuación se muestra un resumen de cómo se usa:

source: It's enabled by setting the C<$|> (C<$AUTOFLUSH>) variable to a true value.
es: Para habilitarlo se establece la variable C<$|> (C<$AUTOFLUSH>) en un valor verdadero.

source: It's good that you lost track, because you shouldn't depend on the internal format being any specific encoding.
es: Eso es una buena señal, ya que no debe esperar que el formato interno tenga una codificación específica.

source: It's important to realize that a regular expression is merely a set of assertions that gives a definition of success.
es: Es importante darse cuenta de que una expresión regular no es más que un conjunto de aserciones que establece una definición de coincidencia.

source: It's important to realize that there are no bytes in a text string.
es: Es importante comprender que en una cadena de texto no hay bytes.

source: It's important to set a few things straight first.
es: Para empezar es importante aclarar algunas ideas.

source: It's just F<perlbug> installed under another name.
es: No es más que F<perlbug> instalado con otro nombre.

source: It's like having the same phone number listed in the phone directory under different names.
es: Es como tener asociado en un listín telefónico un mismo número de teléfono con nombres distintos.

source: It's likely you'll have to add new data types later.
es: Es probable que tenga que agregar nuevos tipos de datos más adelante.

source: It's more convenient than writing out the individual elements as a list of separate scalar values.
es: Esto es más cómodo que escribir los elementos individuales como una lista de valores escalares.

source: It's most useful to use C<git bisect run> to automate the building and testing of perl revisions.
es: El uso de C<git bisect run> resulta muy útil para automatizar la compilación y prueba de las revisiones de perl.

source: It's possible to have a class that does not expose any publicly settable attributes.
es: Es posible tener una clase donde no pueda modificarse ningún atributo.

source: It's possible to substitute for a simple identifier, an expression that produces a reference to the value at runtime.
es: También es posible sustituir un identificador simple por una expresión que produzca una referencia al valor en tiempo de ejecución.

source: It's preferable to patch against the latest blead version, since this is where new development occurs for all changes other than critical bug fixes.
es: Es preferible aplicar un parche a la versión más reciente de blead, ya que es donde tiene lugar el desarrollo actual para todos los cambios que no sean correcciones de errores graves.

source: It's probably best to spend a full day learning all this, but the basics can be learned in minutes.
es: Probablemente lo mejor sea dedicar un día entero a esta tarea, pero para aprender los conceptos básicos bastan unos pocos minutos.

source: It's slow and too clever by far.
es: Es lenta y hace demasiadas suposiciones.

source: It's still in development in both its syntax and design.
es: Su sintaxis y su diseño aún están en fase de desarrollo.

source: It's ultimately up to you (and possibly your management) which tasks you'll use Perl for and which you won't.
es: En última instancia, el usuario (y posiblemente sus jefes) deberán decidir para qué tareas pueden usar Perl, y para cuáles no.

source: It's used as the default argument to a number of functions in Perl, and it's set implicitly by certain looping constructs.
es: Se usa como argumento predeterminado de varias funciones de Perl y su valor se establece implícitamente en determinadas estructuras de bucle.

source: It's used by C to terminate strings, but Perl allows strings to contain a null.
es: En C se usa para terminar cadenas, pero Perl permite que las cadenas contengan caracteres nulos.

source: It's used when you don't want data sitting around not going where it's supposed to, which may happen because the default on a L</file> or L</pipe> is to use L</block buffering>.
es: Se usa cuando no se quiere que queden datos a la espera, sin ir a donde se supone que tienen que ir; esto es algo que puede suceder, ya que en un L</archivo> o una L</tubería> se usa L</almacenamiento en búfer de bloques> de manera predeterminada.

source: It's well established that modern programs need to be capable of communicating funny accented letters, and things like euro symbols.
es: Los programas modernos deben poder comunicar caracteres acentuados o símbolos como el del euro.

source: It's widely used for everything from quick "one-liners" to full-scale application development.
es: Se utiliza para todo tipo de desarrollos, desde "programas de una línea" hasta aplicaciones a gran escala.

source: It's your own fault if you wrote production programs using these features after we explicitly told you not to (see L<perlpolicy>).
es: Si después de que le indicáramos explícitamente que estas funcionalidades no se deben usar en programas de producción y decidió hacerlo, la responsabilidad es suya (vea L<perlpolicy>).

source: Ithreads work by cloning the data tree so that no data is shared between different threads.
es: Los hilos de ejecución de intérprete clonan el árbol de datos de forma que no haya datos compartidos entre distintos hilos de ejecución.

source: Its biggest influence is the Common Lisp Object System, but it also borrows ideas from Smalltalk and several other languages.
es: Su principal influencia es el sistema de orientación a objetos de Common Lisp, pero también toma ideas de Smalltalk y de otros lenguajes.

source: Its major features are that it's easy to use, supports both procedural and object-oriented (OO) programming, has powerful built-in support for text processing, and has one of the world's most impressive collections of third-party modules.
es: Se caracteriza principalmente por su facilidad de uso (permite programar tanto de manera procedural como orientada a objetos (OO)), su magnífica capacidad para procesamiento de texto y por tener una de las colecciones de módulos de terceros más impresionantes del mundo.

source: Its name comes from the observation that this operation combined with the alternation operator (C<|>) can be used to create what is essentially a pattern-based if/then/else block:
es: Su nombre proviene de la observación de que esta operación combinada con el operador de alternancia (C<|>) se puede utilizar para crear lo que, en esencia, es un bloque if/then/else basado en un patrón:

source: Its only use is to force that old behavior.
es: Su única misión es forzar el comportamiento anterior.

source: Its purpose is to allow code that is to work mostly on ASCII data to not have to concern itself with Unicode.
es: Su propósito es permitir que el código que usa principalmente datos ASCII no tenga que preocuparse de Unicode.

source: Its upper eight L<bits|/bit> are the exit status of the defunct process, and its lower eight bits identify the signal (if any) that the process died from.
es: Los ocho L<bits|/bit> superiores son el estado de salida del proceso finalizado, mientras que los ocho bits inferiores identifican la señal (si existe) que hizo que finalizara el proceso.

source: JAPH stands for "Just another Perl hacker,", which Randal Schwartz used to sign email and usenet messages starting in the late 1980s.
es: JAPH significa "Just another Perl hacker". A finales de los ochenta, Randal Schwartz empezó a utilizar esta firma en mensajes de correo electrónico y usenet.

source: Jarkko 5.7.0 2000-Sep-02 The 5.7 track: Development.
es: Jarkko 5.7.0 2000-Sep-02 Serie de desarrollo de v5.7.

source: Jarkko 5.8.0 2002-Jul-18 1205 31 471 From 5.7.3
es: Jarkko 5.8.0 2002-Jul-18 1205 31 471 Desde 5.7.3

source: Jarkko 5.8.1-RC1 2003-Jul-10 The 5.8 maintenance track 5.8.1-RC2 2003-Jul-11 5.8.1-RC3 2003-Jul-30 5.8.1-RC4 2003-Aug-01 5.8.1-RC5 2003-Sep-22 5.8.1 2003-Sep-25
es: Jarkko 5.8.1-RC1 2003-Jul-10 Serie de mantenimiento de v5.8 5.8.1-RC2 2003-Jul-11 5.8.1-RC3 2003-Jul-30 5.8.1-RC4 2003-Ago-01 5.8.1-RC5 2003-Sep-22 5.8.1 2003-Sep-25

source: JavaScript is the most popular language to use another paradigm.
es: JavaScript es el lenguaje más popular que usa un paradigma diferente;

source: JavaScript's OO system is prototype-based.
es: el sistema de orientación a objetos de JavaScript se basa en prototipos.

source: Jesse 5.11.0 2009-Oct-02 The 5.11 development track 5.11.1 2009-Oct-20
es: Jesse 5.11.0 2009-Oct-02 Serie de desarrollo de v5.11 5.11.1 2009-Oct-20

source: Jesse 5.11.3 2009-Dec-20
es: Jesse 5.11.3 2009-Dic-20

source: Jesse 5.12.0 2010-Apr-12
es: Jesse 5.12.0 2010-Abr-12

source: Jesse 5.12.0-RC0 2010-Mar-21 5.12.0-RC1 2010-Mar-29 5.12.0-RC2 2010-Apr-01 5.12.0-RC3 2010-Apr-02 5.12.0-RC4 2010-Apr-06 5.12.0-RC5 2010-Apr-09
es: Jesse 5.12.0-RC0 2010-Mar-21 5.12.0-RC1 2010-Mar-29 5.12.0-RC2 2010-Abr-01 5.12.0-RC3 2010-Abr-02 5.12.0-RC4 2010-Abr-06 5.12.0-RC5 2010-Abr-09

source: Jesse 5.12.1-RC2 2010-May-13 The 5.12 maintenance track 5.12.1-RC1 2010-May-09 5.12.1 2010-May-16 5.12.2-RC2 2010-Aug-31 5.12.2 2010-Sep-06
es: Jesse 5.12.1-RC2 2010-May-13 Serie de mantenimiento de v5.12 5.12.1-RC1 2010-May-09 5.12.1 2010-May-16 5.12.2-RC2 2010-Ago-31 5.12.2 2010-Sep-06

source: Jesse 5.13.9 2011-Jan-20
es: Jesse 5.13.9 2011-Ene-20

source: Jesse 5.14.0 2011-May-14 The 5.14 maintenance track
es: Jesse 5.14.0 2011-May-14 Serie de mantenimiento de v5.14

source: Jesse 5.14.0RC1 2011-Apr-20
es: Jesse 5.14.0RC1 2011-Abr-20

source: Juerd Waalboer <#####@juerd.nl>, with the help of many Perl Monks.
es: Juerd Waalboer <#####@juerd.nl>, con la ayuda de muchos Perl Monks.

source: Just "outdent" it a little to make it more visible:
es: Solo tiene que reducir un poco la sangría para que sea más visible:

source: Just as with any Perl subroutine, all of the arguments passed in C<@_> are aliases to the original argument.
es: Al igual que cualquier subrutina en Perl, todos los argumentos pasados en C<@_> son alias del argumento original.

source: Just because you I<CAN> do something a particular way doesn't mean that you I<SHOULD> do it that way.
es: Que algo se B<pueda> hacer de una determinada manera no significa que se B<deba> hacer de esa manera.

source: Just because you can subscript a list value like a normal array does not mean that you can subscript a list value as a hash.
es: Solo porque se pueda indexar una lista de valores como un array normal no significa que se pueda indexar una lista de valores como un hash.

source: Just don't use it.
es: No la use.

source: Just forget about it.
es: Olvide que existe.

source: Just like special scalars and arrays, there are also special hashes.
es: De la misma manera que hay escalares y arrays especiales, también hay hashes especiales.

source: Just the lines themselves are counted, not their context.
es: Solo se cuentan las líneas, no su contexto.

source: Just use a L</lexical variable> in a scope larger than your L</subroutine>.
es: Simplemente use una L</variable léxica> en un ámbito más amplio que el de la L</subrutina>.

source: Keys that follow the convention won't conflict with the core's historical keys.
es: Las claves que sigan la convención no provocarán conflictos con las claves antiguas del núcleo.

source: L</Makefile> lines are continued by putting a backslash before the L</newline>.
es: Para continuar las líneas de un archivo L</Makefile> se coloca una barra diagonal inversa antes del L</carácter de nueva línea>.

source: L</STDERR> is in the indirect object slot here:
es: Aquí L</STDERR> está en la vacante de objeto indirecto:

source: L</dynamic scoping>.
es: L</control de ámbito dinámico>.

source: L</static scoping>.
es: L</control de ámbito estático>.

source: L<Block buffering|/block buffering> means that the data is passed on to its destination whenever the buffer is full.
es: El L</almacenamiento en búfer de bloques> significa que los datos se pasan a su destino cuando se llena el búfer.

source: L<Class::Accessor> is the polar opposite of C<Moose>.
es: L<Class::Accessor> es el polo opuesto a C<Moose>.

source: L<Command buffering|/command buffering> means that it's passed every time you do a L<print|perlfunc/print> command (or equivalent).
es: El L</almacenamiento en búfer de comandos> significa que los datos se pasan cada vez que se ejecuta un comando L<print|perlfunc/print> (o equivalente).

source: L<DB_File>, L<GDBM_File>, L<NDBM_File>, L<ODBM_File> and L<SDBM_File>.
es: L<DB_File>, L<GDBM_File>, L<NDBM_File>, L<ODBM_File> y L<SDBM_File>.

source: L<Exporter|Exporter> gives you a standard way of exporting symbols and subroutines from your module into the caller's namespace.
es: L<Exporter|Exporter> ofrece una manera estándar de exportar símbolos y subrutinas de su módulo al espacio de nombres del autor de la llamada.

source: L<Instance variables|/instance variable> are also known as fields.
es: Las L<variables de instancia|/variable de instancia> también se denominan campos.

source: L<Line buffering|/line buffering> means that it's passed on whenever a complete line is received.
es: El L</almacenamiento en búfer de líneas> significa que se pasa el contenido siempre que se recibe una línea completa.

source: L<Moose> bills itself as a "postmodern object system for Perl 5".
es: L<Moose> se presenta como un "sistema postmoderno de orientación a objetos para Perl 5".

source: L<Objects|/object> that model things in the real world often have operations that correspond to real activities.
es: Los L<objetos|/objeto> que modelan cosas del mundo real suelen tener operaciones que se corresponden con actividades reales.

source: L<Pattern matching|/pattern matching> that picks up where it left off before.
es: L<Detección de patrones|/detección de patrones> que reanuda la detección desde el punto en que la dejó.

source: L<Perl Mongers|http://www.pm.org/> uses the pm.org domain for services related to local Perl user groups, including the hosting of mailing lists and web sites.
es: L<Perl Mongers|http://www.pm.org/> usa el dominio pm.org para ofrecer servicios relacionados con grupos de usuarios de Perl, como el alojamiento de listas de correo y sitios web.
